{
 "cells": [
  {
   "cell_type": "code",
   "id": "initial_id",
   "metadata": {
    "collapsed": true,
    "ExecuteTime": {
     "end_time": "2024-08-01T11:17:02.865128Z",
     "start_time": "2024-08-01T11:17:02.844137Z"
    }
   },
   "source": [
    "from langchain_community.graphs import Neo4jGraph\n",
    "from dotenv import load_dotenv\n",
    "import os\n",
    "load_dotenv()"
   ],
   "outputs": [
    {
     "data": {
      "text/plain": [
       "True"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 2
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-08-01T11:17:46.420245Z",
     "start_time": "2024-08-01T11:17:46.414245Z"
    }
   },
   "cell_type": "code",
   "source": [
    "NEO4J_URL = os.environ[\"NEO4J_URL\"]\n",
    "NEO4J_USERNAME = os.environ[\"NEO4J_USERNAME\"]\n",
    "NEO4J_PASSWORD = os.environ[\"NEO4J_PASSWORD\"]\n",
    "NEO4J_DATABASE = os.environ[\"NEO4J_DATABASE\"]"
   ],
   "id": "797d1e3e704fa4a4",
   "outputs": [],
   "execution_count": 4
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-08-01T11:18:08.009647Z",
     "start_time": "2024-08-01T11:18:05.719873Z"
    }
   },
   "cell_type": "code",
   "source": "graph = Neo4jGraph(url=NEO4J_URL, username=NEO4J_USERNAME, password=NEO4J_PASSWORD, database=NEO4J_DATABASE)",
   "id": "741d76c6cea634d4",
   "outputs": [],
   "execution_count": 5
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-08-01T11:23:21.334074Z",
     "start_time": "2024-08-01T11:23:21.319451Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# Match all nodes in the graph\n",
    "cypher = \"\"\"\n",
    "    MATCH (n)\n",
    "    RETURN count(n) AS NumberOfNodes\n",
    "\"\"\"\n",
    "result = graph.query(cypher)\n",
    "result"
   ],
   "id": "6e42e58fb25d2c76",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'NumberOfNodes': 9169}]"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 8
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-08-01T11:23:21.917913Z",
     "start_time": "2024-08-01T11:23:21.880349Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# Match only the Home nodes by specifying the node label\n",
    "cypher = \"\"\"\n",
    "    MATCH (h:House)\n",
    "    RETURN count(h) AS NumberOfHouses\n",
    "\"\"\"\n",
    "result = graph.query(cypher)\n",
    "result"
   ],
   "id": "515f4a2f7d20f56c",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'NumberOfHouses': 4600}]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 9
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-08-01T11:44:39.146197Z",
     "start_time": "2024-08-01T11:44:39.101534Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# Match only Country nodes\n",
    "cypher = \"\"\"\n",
    "    MATCH (c:City)\n",
    "    RETURN count(c) AS NumberOfCities\n",
    "\"\"\"\n",
    "result = graph.query(cypher)\n",
    "result"
   ],
   "id": "2b95120b6a19739",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'NumberOfCities': 44}]"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 12
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-08-01T11:44:58.375115Z",
     "start_time": "2024-08-01T11:44:58.335885Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# Match only Street nodes\n",
    "cypher = \"\"\"\n",
    "    MATCH (s:Street)\n",
    "    RETURN count(s) AS NumberOfStreets\n",
    "\"\"\"\n",
    "result = graph.query(cypher)\n",
    "result"
   ],
   "id": "c155bf31a367f141",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'NumberOfStreets': 4525}]"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 13
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-08-01T11:48:32.890095Z",
     "start_time": "2024-08-01T11:48:32.842104Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# Match houses by specifying the value of the 'bedroom' property on the 'House' node\n",
    "cypher = \"\"\"\n",
    "    MATCH (h:House {bedrooms: 1})\n",
    "    RETURN h\n",
    "\"\"\"\n",
    "result = graph.query(cypher)\n",
    "result"
   ],
   "id": "d10c0ab936fc079e",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'h': {'bedrooms': 1,\n",
       "   'condition': 2,\n",
       "   'sqft_basement': 280,\n",
       "   'sqft_living': 1100,\n",
       "   'baths': 1,\n",
       "   'floors': 1.0,\n",
       "   'yr_built': 1947,\n",
       "   'price': 250000,\n",
       "   'sqft_lot': 4373,\n",
       "   'id': '260',\n",
       "   'yr_renovated': 0}},\n",
       " {'h': {'bedrooms': 1,\n",
       "   'condition': 5,\n",
       "   'sqft_basement': 0,\n",
       "   'sqft_living': 810,\n",
       "   'baths': 1,\n",
       "   'floors': 1.0,\n",
       "   'yr_built': 1941,\n",
       "   'price': 235000,\n",
       "   'sqft_lot': 2451,\n",
       "   'id': '477',\n",
       "   'yr_renovated': 0}},\n",
       " {'h': {'bedrooms': 1,\n",
       "   'condition': 3,\n",
       "   'sqft_basement': 0,\n",
       "   'sqft_living': 700,\n",
       "   'baths': 1,\n",
       "   'floors': 1.0,\n",
       "   'yr_built': 1942,\n",
       "   'price': 350000,\n",
       "   'sqft_lot': 5100,\n",
       "   'id': '784',\n",
       "   'yr_renovated': 1999}},\n",
       " {'h': {'bedrooms': 1,\n",
       "   'condition': 3,\n",
       "   'sqft_basement': 0,\n",
       "   'sqft_living': 1140,\n",
       "   'baths': 1,\n",
       "   'floors': 1.0,\n",
       "   'yr_built': 1920,\n",
       "   'price': 540000,\n",
       "   'sqft_lot': 6700,\n",
       "   'id': '831',\n",
       "   'yr_renovated': 1979}},\n",
       " {'h': {'bedrooms': 1,\n",
       "   'condition': 4,\n",
       "   'sqft_basement': 0,\n",
       "   'sqft_living': 810,\n",
       "   'baths': 2,\n",
       "   'floors': 2.0,\n",
       "   'yr_built': 1982,\n",
       "   'price': 285000,\n",
       "   'sqft_lot': 3211,\n",
       "   'id': '883',\n",
       "   'yr_renovated': 2011}},\n",
       " {'h': {'bedrooms': 1,\n",
       "   'condition': 3,\n",
       "   'sqft_basement': 670,\n",
       "   'sqft_living': 2140,\n",
       "   'baths': 2,\n",
       "   'floors': 1.0,\n",
       "   'yr_built': 1976,\n",
       "   'price': 458000,\n",
       "   'sqft_lot': 10350,\n",
       "   'id': '969',\n",
       "   'yr_renovated': 0}},\n",
       " {'h': {'bedrooms': 1,\n",
       "   'condition': 3,\n",
       "   'sqft_basement': 60,\n",
       "   'sqft_living': 820,\n",
       "   'baths': 1,\n",
       "   'floors': 1.0,\n",
       "   'yr_built': 2007,\n",
       "   'price': 194000,\n",
       "   'sqft_lot': 1060,\n",
       "   'id': '1018',\n",
       "   'yr_renovated': 0}},\n",
       " {'h': {'bedrooms': 1,\n",
       "   'condition': 5,\n",
       "   'sqft_basement': 0,\n",
       "   'sqft_living': 960,\n",
       "   'baths': 1,\n",
       "   'floors': 1.0,\n",
       "   'yr_built': 1945,\n",
       "   'price': 420850,\n",
       "   'sqft_lot': 40946,\n",
       "   'id': '1051',\n",
       "   'yr_renovated': 0}},\n",
       " {'h': {'bedrooms': 1,\n",
       "   'condition': 5,\n",
       "   'sqft_basement': 290,\n",
       "   'sqft_living': 1170,\n",
       "   'baths': 1,\n",
       "   'floors': 1.0,\n",
       "   'yr_built': 1962,\n",
       "   'price': 275000,\n",
       "   'sqft_lot': 14149,\n",
       "   'id': '1140',\n",
       "   'yr_renovated': 0}},\n",
       " {'h': {'bedrooms': 1,\n",
       "   'condition': 3,\n",
       "   'sqft_basement': 0,\n",
       "   'sqft_living': 550,\n",
       "   'baths': 1,\n",
       "   'floors': 2.0,\n",
       "   'yr_built': 2008,\n",
       "   'price': 353000,\n",
       "   'sqft_lot': 1279,\n",
       "   'id': '1216',\n",
       "   'yr_renovated': 0}},\n",
       " {'h': {'bedrooms': 1,\n",
       "   'condition': 2,\n",
       "   'sqft_basement': 0,\n",
       "   'sqft_living': 430,\n",
       "   'baths': 1,\n",
       "   'floors': 1.0,\n",
       "   'yr_built': 1912,\n",
       "   'price': 80000,\n",
       "   'sqft_lot': 5050,\n",
       "   'id': '1219',\n",
       "   'yr_renovated': 0}},\n",
       " {'h': {'bedrooms': 1,\n",
       "   'condition': 3,\n",
       "   'sqft_basement': 0,\n",
       "   'sqft_living': 820,\n",
       "   'baths': 1,\n",
       "   'floors': 1.0,\n",
       "   'yr_built': 1999,\n",
       "   'price': 527550,\n",
       "   'sqft_lot': 59677,\n",
       "   'id': '1238',\n",
       "   'yr_renovated': 0}},\n",
       " {'h': {'bedrooms': 1,\n",
       "   'condition': 3,\n",
       "   'sqft_basement': 0,\n",
       "   'sqft_living': 750,\n",
       "   'baths': 1,\n",
       "   'floors': 1.0,\n",
       "   'yr_built': 1918,\n",
       "   'price': 250000,\n",
       "   'sqft_lot': 4000,\n",
       "   'id': '1663',\n",
       "   'yr_renovated': 0}},\n",
       " {'h': {'bedrooms': 1,\n",
       "   'condition': 3,\n",
       "   'sqft_basement': 0,\n",
       "   'sqft_living': 730,\n",
       "   'baths': 1,\n",
       "   'floors': 1.0,\n",
       "   'yr_built': 1911,\n",
       "   'price': 395000,\n",
       "   'sqft_lot': 3000,\n",
       "   'id': '1678',\n",
       "   'yr_renovated': 1979}},\n",
       " {'h': {'bedrooms': 1,\n",
       "   'condition': 3,\n",
       "   'sqft_basement': 0,\n",
       "   'sqft_living': 560,\n",
       "   'baths': 1,\n",
       "   'floors': 1.0,\n",
       "   'yr_built': 1967,\n",
       "   'price': 299000,\n",
       "   'sqft_lot': 12120,\n",
       "   'id': '1833',\n",
       "   'yr_renovated': 2011}},\n",
       " {'h': {'bedrooms': 1,\n",
       "   'condition': 3,\n",
       "   'sqft_basement': 0,\n",
       "   'sqft_living': 790,\n",
       "   'baths': 1,\n",
       "   'floors': 1.0,\n",
       "   'yr_built': 1942,\n",
       "   'price': 135000,\n",
       "   'sqft_lot': 13062,\n",
       "   'id': '1853',\n",
       "   'yr_renovated': 1999}},\n",
       " {'h': {'bedrooms': 1,\n",
       "   'condition': 4,\n",
       "   'sqft_basement': 0,\n",
       "   'sqft_living': 650,\n",
       "   'baths': 1,\n",
       "   'floors': 1.0,\n",
       "   'yr_built': 1967,\n",
       "   'price': 129000,\n",
       "   'sqft_lot': 15364,\n",
       "   'id': '1906',\n",
       "   'yr_renovated': 0}},\n",
       " {'h': {'bedrooms': 1,\n",
       "   'condition': 4,\n",
       "   'sqft_basement': 200,\n",
       "   'sqft_living': 750,\n",
       "   'baths': 2,\n",
       "   'floors': 1.0,\n",
       "   'yr_built': 1946,\n",
       "   'price': 355000,\n",
       "   'sqft_lot': 20339,\n",
       "   'id': '2303',\n",
       "   'yr_renovated': 1989}},\n",
       " {'h': {'bedrooms': 1,\n",
       "   'condition': 3,\n",
       "   'sqft_basement': 0,\n",
       "   'sqft_living': 620,\n",
       "   'baths': 1,\n",
       "   'floors': 1.0,\n",
       "   'yr_built': 1939,\n",
       "   'price': 148000,\n",
       "   'sqft_lot': 8261,\n",
       "   'id': '2318',\n",
       "   'yr_renovated': 1969}},\n",
       " {'h': {'bedrooms': 1,\n",
       "   'condition': 3,\n",
       "   'sqft_basement': 0,\n",
       "   'sqft_living': 420,\n",
       "   'baths': 1,\n",
       "   'floors': 1.0,\n",
       "   'yr_built': 1922,\n",
       "   'price': 280000,\n",
       "   'sqft_lot': 6720,\n",
       "   'id': '2416',\n",
       "   'yr_renovated': 2008}},\n",
       " {'h': {'bedrooms': 1,\n",
       "   'condition': 3,\n",
       "   'sqft_basement': 200,\n",
       "   'sqft_living': 960,\n",
       "   'baths': 1,\n",
       "   'floors': 1.0,\n",
       "   'yr_built': 1908,\n",
       "   'price': 332000,\n",
       "   'sqft_lot': 2640,\n",
       "   'id': '2560',\n",
       "   'yr_renovated': 1988}},\n",
       " {'h': {'bedrooms': 1,\n",
       "   'condition': 3,\n",
       "   'sqft_basement': 0,\n",
       "   'sqft_living': 930,\n",
       "   'baths': 1,\n",
       "   'floors': 1.0,\n",
       "   'yr_built': 1948,\n",
       "   'price': 210000,\n",
       "   'sqft_lot': 7129,\n",
       "   'id': '2625',\n",
       "   'yr_renovated': 1994}},\n",
       " {'h': {'bedrooms': 1,\n",
       "   'condition': 3,\n",
       "   'sqft_basement': 0,\n",
       "   'sqft_living': 720,\n",
       "   'baths': 1,\n",
       "   'floors': 1.0,\n",
       "   'yr_built': 1914,\n",
       "   'price': 190000,\n",
       "   'sqft_lot': 4800,\n",
       "   'id': '2765',\n",
       "   'yr_renovated': 1996}},\n",
       " {'h': {'bedrooms': 1,\n",
       "   'condition': 3,\n",
       "   'sqft_basement': 0,\n",
       "   'sqft_living': 380,\n",
       "   'baths': 1,\n",
       "   'floors': 1.0,\n",
       "   'yr_built': 1963,\n",
       "   'price': 245000,\n",
       "   'sqft_lot': 15000,\n",
       "   'id': '2919',\n",
       "   'yr_renovated': 2008}},\n",
       " {'h': {'bedrooms': 1,\n",
       "   'condition': 2,\n",
       "   'sqft_basement': 120,\n",
       "   'sqft_living': 800,\n",
       "   'baths': 1,\n",
       "   'floors': 1.0,\n",
       "   'yr_built': 1931,\n",
       "   'price': 250000,\n",
       "   'sqft_lot': 16306,\n",
       "   'id': '2966',\n",
       "   'yr_renovated': 0}},\n",
       " {'h': {'bedrooms': 1,\n",
       "   'condition': 3,\n",
       "   'sqft_basement': 0,\n",
       "   'sqft_living': 720,\n",
       "   'baths': 1,\n",
       "   'floors': 1.0,\n",
       "   'yr_built': 1907,\n",
       "   'price': 335000,\n",
       "   'sqft_lot': 5100,\n",
       "   'id': '3129',\n",
       "   'yr_renovated': 1983}},\n",
       " {'h': {'bedrooms': 1,\n",
       "   'condition': 3,\n",
       "   'sqft_basement': 0,\n",
       "   'sqft_living': 930,\n",
       "   'baths': 1,\n",
       "   'floors': 1.0,\n",
       "   'yr_built': 1941,\n",
       "   'price': 190000,\n",
       "   'sqft_lot': 29258,\n",
       "   'id': '3326',\n",
       "   'yr_renovated': 1994}},\n",
       " {'h': {'bedrooms': 1,\n",
       "   'condition': 4,\n",
       "   'sqft_basement': 0,\n",
       "   'sqft_living': 700,\n",
       "   'baths': 1,\n",
       "   'floors': 1.0,\n",
       "   'yr_built': 1907,\n",
       "   'price': 295000,\n",
       "   'sqft_lot': 2500,\n",
       "   'id': '3590',\n",
       "   'yr_renovated': 0}},\n",
       " {'h': {'bedrooms': 1,\n",
       "   'condition': 3,\n",
       "   'sqft_basement': 100,\n",
       "   'sqft_living': 1170,\n",
       "   'baths': 2,\n",
       "   'floors': 2.0,\n",
       "   'yr_built': 2007,\n",
       "   'price': 235000,\n",
       "   'sqft_lot': 1456,\n",
       "   'id': '3605',\n",
       "   'yr_renovated': 0}},\n",
       " {'h': {'bedrooms': 1,\n",
       "   'condition': 3,\n",
       "   'sqft_basement': 0,\n",
       "   'sqft_living': 1100,\n",
       "   'baths': 1,\n",
       "   'floors': 3.0,\n",
       "   'yr_built': 2014,\n",
       "   'price': 516500,\n",
       "   'sqft_lot': 638,\n",
       "   'id': '3608',\n",
       "   'yr_renovated': 0}},\n",
       " {'h': {'bedrooms': 1,\n",
       "   'condition': 3,\n",
       "   'sqft_basement': 0,\n",
       "   'sqft_living': 1010,\n",
       "   'baths': 2,\n",
       "   'floors': 1.0,\n",
       "   'yr_built': 1911,\n",
       "   'price': 410000,\n",
       "   'sqft_lot': 5750,\n",
       "   'id': '3633',\n",
       "   'yr_renovated': 1948}},\n",
       " {'h': {'bedrooms': 1,\n",
       "   'condition': 5,\n",
       "   'sqft_basement': 0,\n",
       "   'sqft_living': 370,\n",
       "   'baths': 1,\n",
       "   'floors': 1.0,\n",
       "   'yr_built': 1923,\n",
       "   'price': 276000,\n",
       "   'sqft_lot': 1801,\n",
       "   'id': '3778',\n",
       "   'yr_renovated': 0}},\n",
       " {'h': {'bedrooms': 1,\n",
       "   'condition': 4,\n",
       "   'sqft_basement': 0,\n",
       "   'sqft_living': 1150,\n",
       "   'baths': 2,\n",
       "   'floors': 1.0,\n",
       "   'yr_built': 1962,\n",
       "   'price': 115000,\n",
       "   'sqft_lot': 9812,\n",
       "   'id': '4113',\n",
       "   'yr_renovated': 0}},\n",
       " {'h': {'bedrooms': 1,\n",
       "   'condition': 2,\n",
       "   'sqft_basement': 0,\n",
       "   'sqft_living': 850,\n",
       "   'baths': 1,\n",
       "   'floors': 1.0,\n",
       "   'yr_built': 1906,\n",
       "   'price': 165000,\n",
       "   'sqft_lot': 8050,\n",
       "   'id': '4117',\n",
       "   'yr_renovated': 0}},\n",
       " {'h': {'bedrooms': 1,\n",
       "   'condition': 3,\n",
       "   'sqft_basement': 0,\n",
       "   'sqft_living': 730,\n",
       "   'baths': 1,\n",
       "   'floors': 1.0,\n",
       "   'yr_built': 2008,\n",
       "   'price': 321500,\n",
       "   'sqft_lot': 1942,\n",
       "   'id': '4237',\n",
       "   'yr_renovated': 0}},\n",
       " {'h': {'bedrooms': 1,\n",
       "   'condition': 4,\n",
       "   'sqft_basement': 0,\n",
       "   'sqft_living': 590,\n",
       "   'baths': 1,\n",
       "   'floors': 1.0,\n",
       "   'yr_built': 1926,\n",
       "   'price': 202000,\n",
       "   'sqft_lot': 833,\n",
       "   'id': '4338',\n",
       "   'yr_renovated': 1993}},\n",
       " {'h': {'bedrooms': 1,\n",
       "   'condition': 3,\n",
       "   'sqft_basement': 0,\n",
       "   'sqft_living': 720,\n",
       "   'baths': 1,\n",
       "   'floors': 1.0,\n",
       "   'yr_built': 1940,\n",
       "   'price': 0,\n",
       "   'sqft_lot': 6000,\n",
       "   'id': '4442',\n",
       "   'yr_renovated': 1996}},\n",
       " {'h': {'bedrooms': 1,\n",
       "   'condition': 3,\n",
       "   'sqft_basement': 0,\n",
       "   'sqft_living': 690,\n",
       "   'baths': 1,\n",
       "   'floors': 1.0,\n",
       "   'yr_built': 1928,\n",
       "   'price': 167500,\n",
       "   'sqft_lot': 1950,\n",
       "   'id': '4556',\n",
       "   'yr_renovated': 1954}}]"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 16
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-08-01T16:48:00.144254Z",
     "start_time": "2024-08-01T16:47:57.933884Z"
    }
   },
   "cell_type": "code",
   "source": [
    "cypher = \"\"\"\n",
    "    MATCH (h:House)\n",
    "    WHERE NOT (h)-[:LOCATED_IN]->(:City)\n",
    "    RETURN h\n",
    "\"\"\"\n",
    "result = graph.query(cypher)\n",
    "result"
   ],
   "id": "c43668d6c957be37",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 17
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-08-01T16:49:28.718926Z",
     "start_time": "2024-08-01T16:49:28.419802Z"
    }
   },
   "cell_type": "code",
   "source": [
    "cypher = \"\"\"\n",
    "    MATCH (h:House)\n",
    "    OPTIONAL MATCH (h)-[:LOCATED_IN]->(c:City)\n",
    "    RETURN h.id, c.name\n",
    "\"\"\"\n",
    "result = graph.query(cypher)\n",
    "result"
   ],
   "id": "7b2036db1a961e01",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'h.id': '0', 'c.name': 'Shoreline'},\n",
       " {'h.id': '1', 'c.name': 'Seattle'},\n",
       " {'h.id': '2', 'c.name': 'Kent'},\n",
       " {'h.id': '3', 'c.name': 'Bellevue'},\n",
       " {'h.id': '4', 'c.name': 'Redmond'},\n",
       " {'h.id': '5', 'c.name': 'Seattle'},\n",
       " {'h.id': '6', 'c.name': 'Redmond'},\n",
       " {'h.id': '7', 'c.name': 'Maple Valley'},\n",
       " {'h.id': '8', 'c.name': 'North Bend'},\n",
       " {'h.id': '9', 'c.name': 'Seattle'},\n",
       " {'h.id': '10', 'c.name': 'Lake Forest Park'},\n",
       " {'h.id': '11', 'c.name': 'Seattle'},\n",
       " {'h.id': '12', 'c.name': 'Sammamish'},\n",
       " {'h.id': '13', 'c.name': 'Seattle'},\n",
       " {'h.id': '14', 'c.name': 'Seattle'},\n",
       " {'h.id': '15', 'c.name': 'Kent'},\n",
       " {'h.id': '16', 'c.name': 'Bellevue'},\n",
       " {'h.id': '17', 'c.name': 'Auburn'},\n",
       " {'h.id': '18', 'c.name': 'Des Moines'},\n",
       " {'h.id': '19', 'c.name': 'North Bend'},\n",
       " {'h.id': '20', 'c.name': 'Seattle'},\n",
       " {'h.id': '21', 'c.name': 'Bellevue'},\n",
       " {'h.id': '22', 'c.name': 'Seattle'},\n",
       " {'h.id': '23', 'c.name': 'Bothell'},\n",
       " {'h.id': '24', 'c.name': 'Seattle'},\n",
       " {'h.id': '25', 'c.name': 'Federal Way'},\n",
       " {'h.id': '26', 'c.name': 'Seattle'},\n",
       " {'h.id': '27', 'c.name': 'Kirkland'},\n",
       " {'h.id': '28', 'c.name': 'Issaquah'},\n",
       " {'h.id': '29', 'c.name': 'Seattle'},\n",
       " {'h.id': '30', 'c.name': 'Kirkland'},\n",
       " {'h.id': '31', 'c.name': 'Woodinville'},\n",
       " {'h.id': '32', 'c.name': 'Seattle'},\n",
       " {'h.id': '33', 'c.name': 'Shoreline'},\n",
       " {'h.id': '34', 'c.name': 'Auburn'},\n",
       " {'h.id': '35', 'c.name': 'Federal Way'},\n",
       " {'h.id': '36', 'c.name': 'Seattle'},\n",
       " {'h.id': '37', 'c.name': 'Maple Valley'},\n",
       " {'h.id': '38', 'c.name': 'Normandy Park'},\n",
       " {'h.id': '39', 'c.name': 'Seattle'},\n",
       " {'h.id': '40', 'c.name': 'Fall City'},\n",
       " {'h.id': '41', 'c.name': 'Renton'},\n",
       " {'h.id': '42', 'c.name': 'Shoreline'},\n",
       " {'h.id': '43', 'c.name': 'Seattle'},\n",
       " {'h.id': '44', 'c.name': 'Seattle'},\n",
       " {'h.id': '45', 'c.name': 'Woodinville'},\n",
       " {'h.id': '46', 'c.name': 'Issaquah'},\n",
       " {'h.id': '47', 'c.name': 'Renton'},\n",
       " {'h.id': '48', 'c.name': 'Seattle'},\n",
       " {'h.id': '49', 'c.name': 'Redmond'},\n",
       " {'h.id': '50', 'c.name': 'Issaquah'},\n",
       " {'h.id': '51', 'c.name': 'Sammamish'},\n",
       " {'h.id': '52', 'c.name': 'Seattle'},\n",
       " {'h.id': '53', 'c.name': 'Carnation'},\n",
       " {'h.id': '54', 'c.name': 'Bothell'},\n",
       " {'h.id': '55', 'c.name': 'Bellevue'},\n",
       " {'h.id': '56', 'c.name': 'Auburn'},\n",
       " {'h.id': '57', 'c.name': 'Snoqualmie'},\n",
       " {'h.id': '58', 'c.name': 'Seattle'},\n",
       " {'h.id': '59', 'c.name': 'Seattle'},\n",
       " {'h.id': '60', 'c.name': 'Snoqualmie'},\n",
       " {'h.id': '61', 'c.name': 'North Bend'},\n",
       " {'h.id': '62', 'c.name': 'Renton'},\n",
       " {'h.id': '63', 'c.name': 'Kent'},\n",
       " {'h.id': '64', 'c.name': 'Renton'},\n",
       " {'h.id': '65', 'c.name': 'Seattle'},\n",
       " {'h.id': '66', 'c.name': 'Issaquah'},\n",
       " {'h.id': '67', 'c.name': 'Snoqualmie'},\n",
       " {'h.id': '68', 'c.name': 'Redmond'},\n",
       " {'h.id': '69', 'c.name': 'Renton'},\n",
       " {'h.id': '70', 'c.name': 'Auburn'},\n",
       " {'h.id': '71', 'c.name': 'Seattle'},\n",
       " {'h.id': '72', 'c.name': 'Seattle'},\n",
       " {'h.id': '73', 'c.name': 'Sammamish'},\n",
       " {'h.id': '74', 'c.name': 'Kirkland'},\n",
       " {'h.id': '75', 'c.name': 'Seattle'},\n",
       " {'h.id': '76', 'c.name': 'Seattle'},\n",
       " {'h.id': '77', 'c.name': 'Sammamish'},\n",
       " {'h.id': '78', 'c.name': 'Bellevue'},\n",
       " {'h.id': '79', 'c.name': 'Issaquah'},\n",
       " {'h.id': '80', 'c.name': 'Issaquah'},\n",
       " {'h.id': '81', 'c.name': 'Sammamish'},\n",
       " {'h.id': '82', 'c.name': 'Seattle'},\n",
       " {'h.id': '83', 'c.name': 'Issaquah'},\n",
       " {'h.id': '84', 'c.name': 'Kirkland'},\n",
       " {'h.id': '85', 'c.name': 'Shoreline'},\n",
       " {'h.id': '86', 'c.name': 'Seattle'},\n",
       " {'h.id': '87', 'c.name': 'Kirkland'},\n",
       " {'h.id': '88', 'c.name': 'Seattle'},\n",
       " {'h.id': '89', 'c.name': 'Des Moines'},\n",
       " {'h.id': '90', 'c.name': 'Kirkland'},\n",
       " {'h.id': '91', 'c.name': 'Seattle'},\n",
       " {'h.id': '92', 'c.name': 'Seattle'},\n",
       " {'h.id': '93', 'c.name': 'Seattle'},\n",
       " {'h.id': '94', 'c.name': 'Seattle'},\n",
       " {'h.id': '95', 'c.name': 'Bellevue'},\n",
       " {'h.id': '96', 'c.name': 'Seattle'},\n",
       " {'h.id': '97', 'c.name': 'Federal Way'},\n",
       " {'h.id': '98', 'c.name': 'Seattle'},\n",
       " {'h.id': '99', 'c.name': 'Seattle'},\n",
       " {'h.id': '100', 'c.name': 'Renton'},\n",
       " {'h.id': '101', 'c.name': 'Redmond'},\n",
       " {'h.id': '102', 'c.name': 'Bellevue'},\n",
       " {'h.id': '103', 'c.name': 'Auburn'},\n",
       " {'h.id': '104', 'c.name': 'Seattle'},\n",
       " {'h.id': '105', 'c.name': 'Snoqualmie'},\n",
       " {'h.id': '106', 'c.name': 'Bellevue'},\n",
       " {'h.id': '107', 'c.name': 'Redmond'},\n",
       " {'h.id': '108', 'c.name': 'Seattle'},\n",
       " {'h.id': '109', 'c.name': 'Federal Way'},\n",
       " {'h.id': '110', 'c.name': 'Seattle'},\n",
       " {'h.id': '111', 'c.name': 'Maple Valley'},\n",
       " {'h.id': '112', 'c.name': 'Duvall'},\n",
       " {'h.id': '113', 'c.name': 'Issaquah'},\n",
       " {'h.id': '114', 'c.name': 'Seattle'},\n",
       " {'h.id': '115', 'c.name': 'Kirkland'},\n",
       " {'h.id': '116', 'c.name': 'Seattle'},\n",
       " {'h.id': '117', 'c.name': 'Burien'},\n",
       " {'h.id': '118', 'c.name': 'Bellevue'},\n",
       " {'h.id': '119', 'c.name': 'Sammamish'},\n",
       " {'h.id': '120', 'c.name': 'Shoreline'},\n",
       " {'h.id': '121', 'c.name': 'Seattle'},\n",
       " {'h.id': '122', 'c.name': 'Redmond'},\n",
       " {'h.id': '123', 'c.name': 'Renton'},\n",
       " {'h.id': '124', 'c.name': 'Seattle'},\n",
       " {'h.id': '125', 'c.name': 'Seattle'},\n",
       " {'h.id': '126', 'c.name': 'Seattle'},\n",
       " {'h.id': '127', 'c.name': 'Seattle'},\n",
       " {'h.id': '128', 'c.name': 'Auburn'},\n",
       " {'h.id': '129', 'c.name': 'Renton'},\n",
       " {'h.id': '130', 'c.name': 'Sammamish'},\n",
       " {'h.id': '131', 'c.name': 'Renton'},\n",
       " {'h.id': '132', 'c.name': 'Des Moines'},\n",
       " {'h.id': '133', 'c.name': 'Seattle'},\n",
       " {'h.id': '134', 'c.name': 'Seattle'},\n",
       " {'h.id': '135', 'c.name': 'Redmond'},\n",
       " {'h.id': '136', 'c.name': 'Seattle'},\n",
       " {'h.id': '137', 'c.name': 'Kirkland'},\n",
       " {'h.id': '138', 'c.name': 'Issaquah'},\n",
       " {'h.id': '139', 'c.name': 'Seattle'},\n",
       " {'h.id': '140', 'c.name': 'Issaquah'},\n",
       " {'h.id': '141', 'c.name': 'Seattle'},\n",
       " {'h.id': '142', 'c.name': 'Redmond'},\n",
       " {'h.id': '143', 'c.name': 'Issaquah'},\n",
       " {'h.id': '144', 'c.name': 'Seattle'},\n",
       " {'h.id': '145', 'c.name': 'Issaquah'},\n",
       " {'h.id': '146', 'c.name': 'Seattle'},\n",
       " {'h.id': '147', 'c.name': 'Renton'},\n",
       " {'h.id': '148', 'c.name': 'Issaquah'},\n",
       " {'h.id': '149', 'c.name': 'Issaquah'},\n",
       " {'h.id': '150', 'c.name': 'Redmond'},\n",
       " {'h.id': '151', 'c.name': 'Kirkland'},\n",
       " {'h.id': '152', 'c.name': 'Seattle'},\n",
       " {'h.id': '153', 'c.name': 'Seattle'},\n",
       " {'h.id': '154', 'c.name': 'Redmond'},\n",
       " {'h.id': '155', 'c.name': 'Covington'},\n",
       " {'h.id': '156', 'c.name': 'Seattle'},\n",
       " {'h.id': '157', 'c.name': 'Seattle'},\n",
       " {'h.id': '158', 'c.name': 'Seattle'},\n",
       " {'h.id': '159', 'c.name': 'Seattle'},\n",
       " {'h.id': '160', 'c.name': 'Des Moines'},\n",
       " {'h.id': '161', 'c.name': 'Issaquah'},\n",
       " {'h.id': '162', 'c.name': 'Seattle'},\n",
       " {'h.id': '163', 'c.name': 'Seattle'},\n",
       " {'h.id': '164', 'c.name': 'Seattle'},\n",
       " {'h.id': '165', 'c.name': 'Seattle'},\n",
       " {'h.id': '166', 'c.name': 'Inglewood-Finn Hill'},\n",
       " {'h.id': '167', 'c.name': 'Seattle'},\n",
       " {'h.id': '168', 'c.name': 'Shoreline'},\n",
       " {'h.id': '169', 'c.name': 'Bellevue'},\n",
       " {'h.id': '170', 'c.name': 'Kenmore'},\n",
       " {'h.id': '171', 'c.name': 'Bellevue'},\n",
       " {'h.id': '172', 'c.name': 'Des Moines'},\n",
       " {'h.id': '173', 'c.name': 'Carnation'},\n",
       " {'h.id': '174', 'c.name': 'Burien'},\n",
       " {'h.id': '175', 'c.name': 'Kirkland'},\n",
       " {'h.id': '176', 'c.name': 'Kent'},\n",
       " {'h.id': '177', 'c.name': 'Shoreline'},\n",
       " {'h.id': '178', 'c.name': 'Kenmore'},\n",
       " {'h.id': '179', 'c.name': 'Renton'},\n",
       " {'h.id': '180', 'c.name': 'Renton'},\n",
       " {'h.id': '181', 'c.name': 'Seattle'},\n",
       " {'h.id': '182', 'c.name': 'Renton'},\n",
       " {'h.id': '183', 'c.name': 'Kirkland'},\n",
       " {'h.id': '184', 'c.name': 'Bellevue'},\n",
       " {'h.id': '185', 'c.name': 'Kenmore'},\n",
       " {'h.id': '186', 'c.name': 'Seattle'},\n",
       " {'h.id': '187', 'c.name': 'Federal Way'},\n",
       " {'h.id': '188', 'c.name': 'Bellevue'},\n",
       " {'h.id': '189', 'c.name': 'Redmond'},\n",
       " {'h.id': '190', 'c.name': 'Federal Way'},\n",
       " {'h.id': '191', 'c.name': 'Seattle'},\n",
       " {'h.id': '192', 'c.name': 'Seattle'},\n",
       " {'h.id': '193', 'c.name': 'Seattle'},\n",
       " {'h.id': '194', 'c.name': 'North Bend'},\n",
       " {'h.id': '195', 'c.name': 'Sammamish'},\n",
       " {'h.id': '196', 'c.name': 'Kenmore'},\n",
       " {'h.id': '197', 'c.name': 'Bellevue'},\n",
       " {'h.id': '198', 'c.name': 'Sammamish'},\n",
       " {'h.id': '199', 'c.name': 'Seattle'},\n",
       " {'h.id': '200', 'c.name': 'Sammamish'},\n",
       " {'h.id': '201', 'c.name': 'Seattle'},\n",
       " {'h.id': '202', 'c.name': 'Redmond'},\n",
       " {'h.id': '203', 'c.name': 'Bellevue'},\n",
       " {'h.id': '204', 'c.name': 'Sammamish'},\n",
       " {'h.id': '205', 'c.name': 'Seattle'},\n",
       " {'h.id': '206', 'c.name': 'Newcastle'},\n",
       " {'h.id': '207', 'c.name': 'Auburn'},\n",
       " {'h.id': '208', 'c.name': 'Newcastle'},\n",
       " {'h.id': '209', 'c.name': 'Woodinville'},\n",
       " {'h.id': '210', 'c.name': 'Shoreline'},\n",
       " {'h.id': '211', 'c.name': 'Seattle'},\n",
       " {'h.id': '212', 'c.name': 'Seattle'},\n",
       " {'h.id': '213', 'c.name': 'Seattle'},\n",
       " {'h.id': '214', 'c.name': 'Bellevue'},\n",
       " {'h.id': '215', 'c.name': 'Auburn'},\n",
       " {'h.id': '216', 'c.name': 'Seattle'},\n",
       " {'h.id': '217', 'c.name': 'Mercer Island'},\n",
       " {'h.id': '218', 'c.name': 'Federal Way'},\n",
       " {'h.id': '219', 'c.name': 'Seattle'},\n",
       " {'h.id': '220', 'c.name': 'Seattle'},\n",
       " {'h.id': '221', 'c.name': 'Federal Way'},\n",
       " {'h.id': '222', 'c.name': 'Seattle'},\n",
       " {'h.id': '223', 'c.name': 'Seattle'},\n",
       " {'h.id': '224', 'c.name': 'Seattle'},\n",
       " {'h.id': '225', 'c.name': 'Renton'},\n",
       " {'h.id': '226', 'c.name': 'Seattle'},\n",
       " {'h.id': '227', 'c.name': 'Bellevue'},\n",
       " {'h.id': '228', 'c.name': 'Redmond'},\n",
       " {'h.id': '229', 'c.name': 'Seattle'},\n",
       " {'h.id': '230', 'c.name': 'Burien'},\n",
       " {'h.id': '231', 'c.name': 'Seattle'},\n",
       " {'h.id': '232', 'c.name': 'Shoreline'},\n",
       " {'h.id': '233', 'c.name': 'Redmond'},\n",
       " {'h.id': '234', 'c.name': 'Black Diamond'},\n",
       " {'h.id': '235', 'c.name': 'Kirkland'},\n",
       " {'h.id': '236', 'c.name': 'Maple Valley'},\n",
       " {'h.id': '237', 'c.name': 'Burien'},\n",
       " {'h.id': '238', 'c.name': 'Renton'},\n",
       " {'h.id': '239', 'c.name': 'Seattle'},\n",
       " {'h.id': '240', 'c.name': 'Ravensdale'},\n",
       " {'h.id': '241', 'c.name': 'Seattle'},\n",
       " {'h.id': '242', 'c.name': 'Kirkland'},\n",
       " {'h.id': '243', 'c.name': 'Covington'},\n",
       " {'h.id': '244', 'c.name': 'Kent'},\n",
       " {'h.id': '245', 'c.name': 'Redmond'},\n",
       " {'h.id': '246', 'c.name': 'Bellevue'},\n",
       " {'h.id': '247', 'c.name': 'Seattle'},\n",
       " {'h.id': '248', 'c.name': 'Carnation'},\n",
       " {'h.id': '249', 'c.name': 'Bothell'},\n",
       " {'h.id': '250', 'c.name': 'Burien'},\n",
       " {'h.id': '251', 'c.name': 'Federal Way'},\n",
       " {'h.id': '252', 'c.name': 'Seattle'},\n",
       " {'h.id': '253', 'c.name': 'Seattle'},\n",
       " {'h.id': '254', 'c.name': 'Carnation'},\n",
       " {'h.id': '255', 'c.name': 'Kirkland'},\n",
       " {'h.id': '256', 'c.name': 'Bellevue'},\n",
       " {'h.id': '257', 'c.name': 'Seattle'},\n",
       " {'h.id': '258', 'c.name': 'Renton'},\n",
       " {'h.id': '259', 'c.name': 'Seattle'},\n",
       " {'h.id': '260', 'c.name': 'Burien'},\n",
       " {'h.id': '261', 'c.name': 'Kirkland'},\n",
       " {'h.id': '262', 'c.name': 'Kent'},\n",
       " {'h.id': '263', 'c.name': 'Issaquah'},\n",
       " {'h.id': '264', 'c.name': 'Seattle'},\n",
       " {'h.id': '265', 'c.name': 'Seattle'},\n",
       " {'h.id': '266', 'c.name': 'Seattle'},\n",
       " {'h.id': '267', 'c.name': 'Kirkland'},\n",
       " {'h.id': '268', 'c.name': 'Redmond'},\n",
       " {'h.id': '269', 'c.name': 'Seattle'},\n",
       " {'h.id': '270', 'c.name': 'Shoreline'},\n",
       " {'h.id': '271', 'c.name': 'Renton'},\n",
       " {'h.id': '272', 'c.name': 'Woodinville'},\n",
       " {'h.id': '273', 'c.name': 'Clyde Hill'},\n",
       " {'h.id': '274', 'c.name': 'Seattle'},\n",
       " {'h.id': '275', 'c.name': 'Seattle'},\n",
       " {'h.id': '276', 'c.name': 'Seattle'},\n",
       " {'h.id': '277', 'c.name': 'Federal Way'},\n",
       " {'h.id': '278', 'c.name': 'Issaquah'},\n",
       " {'h.id': '279', 'c.name': 'Renton'},\n",
       " {'h.id': '280', 'c.name': 'Seattle'},\n",
       " {'h.id': '281', 'c.name': 'Seattle'},\n",
       " {'h.id': '282', 'c.name': 'Redmond'},\n",
       " {'h.id': '283', 'c.name': 'Renton'},\n",
       " {'h.id': '284', 'c.name': 'Seattle'},\n",
       " {'h.id': '285', 'c.name': 'Seattle'},\n",
       " {'h.id': '286', 'c.name': 'Issaquah'},\n",
       " {'h.id': '287', 'c.name': 'Kent'},\n",
       " {'h.id': '288', 'c.name': 'Renton'},\n",
       " {'h.id': '289', 'c.name': 'Seattle'},\n",
       " {'h.id': '290', 'c.name': 'Algona'},\n",
       " {'h.id': '291', 'c.name': 'Lake Forest Park'},\n",
       " {'h.id': '292', 'c.name': 'Woodinville'},\n",
       " {'h.id': '293', 'c.name': 'Auburn'},\n",
       " {'h.id': '294', 'c.name': 'Seattle'},\n",
       " {'h.id': '295', 'c.name': 'Seattle'},\n",
       " {'h.id': '296', 'c.name': 'Issaquah'},\n",
       " {'h.id': '297', 'c.name': 'Seattle'},\n",
       " {'h.id': '298', 'c.name': 'Kent'},\n",
       " {'h.id': '299', 'c.name': 'Federal Way'},\n",
       " {'h.id': '300', 'c.name': 'Covington'},\n",
       " {'h.id': '301', 'c.name': 'Seattle'},\n",
       " {'h.id': '302', 'c.name': 'Kenmore'},\n",
       " {'h.id': '303', 'c.name': 'Seattle'},\n",
       " {'h.id': '304', 'c.name': 'Shoreline'},\n",
       " {'h.id': '305', 'c.name': 'Maple Valley'},\n",
       " {'h.id': '306', 'c.name': 'Seattle'},\n",
       " {'h.id': '307', 'c.name': 'Burien'},\n",
       " {'h.id': '308', 'c.name': 'Seattle'},\n",
       " {'h.id': '309', 'c.name': 'Kirkland'},\n",
       " {'h.id': '310', 'c.name': 'Kirkland'},\n",
       " {'h.id': '311', 'c.name': 'Seattle'},\n",
       " {'h.id': '312', 'c.name': 'Auburn'},\n",
       " {'h.id': '313', 'c.name': 'Seattle'},\n",
       " {'h.id': '314', 'c.name': 'Seattle'},\n",
       " {'h.id': '315', 'c.name': 'Seattle'},\n",
       " {'h.id': '316', 'c.name': 'Seattle'},\n",
       " {'h.id': '317', 'c.name': 'Duvall'},\n",
       " {'h.id': '318', 'c.name': 'Mercer Island'},\n",
       " {'h.id': '319', 'c.name': 'Federal Way'},\n",
       " {'h.id': '320', 'c.name': 'Seattle'},\n",
       " {'h.id': '321', 'c.name': 'Sammamish'},\n",
       " {'h.id': '322', 'c.name': 'Mercer Island'},\n",
       " {'h.id': '323', 'c.name': 'Seattle'},\n",
       " {'h.id': '324', 'c.name': 'Algona'},\n",
       " {'h.id': '325', 'c.name': 'Issaquah'},\n",
       " {'h.id': '326', 'c.name': 'Skykomish'},\n",
       " {'h.id': '327', 'c.name': 'Kirkland'},\n",
       " {'h.id': '328', 'c.name': 'Seattle'},\n",
       " {'h.id': '329', 'c.name': 'Seattle'},\n",
       " {'h.id': '330', 'c.name': 'Redmond'},\n",
       " {'h.id': '331', 'c.name': 'Kent'},\n",
       " {'h.id': '332', 'c.name': 'Kent'},\n",
       " {'h.id': '333', 'c.name': 'Issaquah'},\n",
       " {'h.id': '334', 'c.name': 'Seattle'},\n",
       " {'h.id': '335', 'c.name': 'Kent'},\n",
       " {'h.id': '336', 'c.name': 'Kent'},\n",
       " {'h.id': '337', 'c.name': 'Normandy Park'},\n",
       " {'h.id': '338', 'c.name': 'Seattle'},\n",
       " {'h.id': '339', 'c.name': 'Redmond'},\n",
       " {'h.id': '340', 'c.name': 'Kent'},\n",
       " {'h.id': '341', 'c.name': 'Seattle'},\n",
       " {'h.id': '342', 'c.name': 'Seattle'},\n",
       " {'h.id': '343', 'c.name': 'Bellevue'},\n",
       " {'h.id': '344', 'c.name': 'Kent'},\n",
       " {'h.id': '345', 'c.name': 'Auburn'},\n",
       " {'h.id': '346', 'c.name': 'Federal Way'},\n",
       " {'h.id': '347', 'c.name': 'Seattle'},\n",
       " {'h.id': '348', 'c.name': 'Kent'},\n",
       " {'h.id': '349', 'c.name': 'Seattle'},\n",
       " {'h.id': '350', 'c.name': 'Seattle'},\n",
       " {'h.id': '351', 'c.name': 'Sammamish'},\n",
       " {'h.id': '352', 'c.name': 'Seattle'},\n",
       " {'h.id': '353', 'c.name': 'Seattle'},\n",
       " {'h.id': '354', 'c.name': 'Redmond'},\n",
       " {'h.id': '355', 'c.name': 'Bellevue'},\n",
       " {'h.id': '356', 'c.name': 'Seattle'},\n",
       " {'h.id': '357', 'c.name': 'Seattle'},\n",
       " {'h.id': '358', 'c.name': 'Woodinville'},\n",
       " {'h.id': '359', 'c.name': 'Bellevue'},\n",
       " {'h.id': '360', 'c.name': 'Renton'},\n",
       " {'h.id': '361', 'c.name': 'Seattle'},\n",
       " {'h.id': '362', 'c.name': 'Woodinville'},\n",
       " {'h.id': '363', 'c.name': 'Seattle'},\n",
       " {'h.id': '364', 'c.name': 'Tukwila'},\n",
       " {'h.id': '365', 'c.name': 'Redmond'},\n",
       " {'h.id': '366', 'c.name': 'Seattle'},\n",
       " {'h.id': '367', 'c.name': 'Kirkland'},\n",
       " {'h.id': '368', 'c.name': 'Seattle'},\n",
       " {'h.id': '369', 'c.name': 'Federal Way'},\n",
       " {'h.id': '370', 'c.name': 'Renton'},\n",
       " {'h.id': '371', 'c.name': 'Des Moines'},\n",
       " {'h.id': '372', 'c.name': 'Burien'},\n",
       " {'h.id': '373', 'c.name': 'Mercer Island'},\n",
       " {'h.id': '374', 'c.name': 'Seattle'},\n",
       " {'h.id': '375', 'c.name': 'Snoqualmie'},\n",
       " {'h.id': '376', 'c.name': 'Redmond'},\n",
       " {'h.id': '377', 'c.name': 'Algona'},\n",
       " {'h.id': '378', 'c.name': 'Seattle'},\n",
       " {'h.id': '379', 'c.name': 'Renton'},\n",
       " {'h.id': '380', 'c.name': 'Seattle'},\n",
       " {'h.id': '381', 'c.name': 'Burien'},\n",
       " {'h.id': '382', 'c.name': 'Seattle'},\n",
       " {'h.id': '383', 'c.name': 'Seattle'},\n",
       " {'h.id': '384', 'c.name': 'Seattle'},\n",
       " {'h.id': '385', 'c.name': 'Kenmore'},\n",
       " {'h.id': '386', 'c.name': 'Seattle'},\n",
       " {'h.id': '387', 'c.name': 'Seattle'},\n",
       " {'h.id': '388', 'c.name': 'Woodinville'},\n",
       " {'h.id': '389', 'c.name': 'Renton'},\n",
       " {'h.id': '390', 'c.name': 'Renton'},\n",
       " {'h.id': '391', 'c.name': 'Issaquah'},\n",
       " {'h.id': '392', 'c.name': 'Seattle'},\n",
       " {'h.id': '393', 'c.name': 'Auburn'},\n",
       " {'h.id': '394', 'c.name': 'Covington'},\n",
       " {'h.id': '395', 'c.name': 'Vashon'},\n",
       " {'h.id': '396', 'c.name': 'Woodinville'},\n",
       " {'h.id': '397', 'c.name': 'Sammamish'},\n",
       " {'h.id': '398', 'c.name': 'Federal Way'},\n",
       " {'h.id': '399', 'c.name': 'Renton'},\n",
       " {'h.id': '400', 'c.name': 'Issaquah'},\n",
       " {'h.id': '401', 'c.name': 'Lake Forest Park'},\n",
       " {'h.id': '402', 'c.name': 'Seattle'},\n",
       " {'h.id': '403', 'c.name': 'Seattle'},\n",
       " {'h.id': '404', 'c.name': 'Sammamish'},\n",
       " {'h.id': '405', 'c.name': 'Seattle'},\n",
       " {'h.id': '406', 'c.name': 'Fall City'},\n",
       " {'h.id': '407', 'c.name': 'Issaquah'},\n",
       " {'h.id': '408', 'c.name': 'Seattle'},\n",
       " {'h.id': '409', 'c.name': 'Snoqualmie'},\n",
       " {'h.id': '410', 'c.name': 'Kirkland'},\n",
       " {'h.id': '411', 'c.name': 'Seattle'},\n",
       " {'h.id': '412', 'c.name': 'Renton'},\n",
       " {'h.id': '413', 'c.name': 'Seattle'},\n",
       " {'h.id': '414', 'c.name': 'Bellevue'},\n",
       " {'h.id': '415', 'c.name': 'Auburn'},\n",
       " {'h.id': '416', 'c.name': 'Federal Way'},\n",
       " {'h.id': '417', 'c.name': 'Kent'},\n",
       " {'h.id': '418', 'c.name': 'Woodinville'},\n",
       " {'h.id': '419', 'c.name': 'Seattle'},\n",
       " {'h.id': '420', 'c.name': 'Algona'},\n",
       " {'h.id': '421', 'c.name': 'Issaquah'},\n",
       " {'h.id': '422', 'c.name': 'Kenmore'},\n",
       " {'h.id': '423', 'c.name': 'Seattle'},\n",
       " {'h.id': '424', 'c.name': 'Seattle'},\n",
       " {'h.id': '425', 'c.name': 'Kent'},\n",
       " {'h.id': '426', 'c.name': 'Woodinville'},\n",
       " {'h.id': '427', 'c.name': 'Kent'},\n",
       " {'h.id': '428', 'c.name': 'Redmond'},\n",
       " {'h.id': '429', 'c.name': 'Bellevue'},\n",
       " {'h.id': '430', 'c.name': 'Redmond'},\n",
       " {'h.id': '431', 'c.name': 'Auburn'},\n",
       " {'h.id': '432', 'c.name': 'Renton'},\n",
       " {'h.id': '433', 'c.name': 'Seattle'},\n",
       " {'h.id': '434', 'c.name': 'Sammamish'},\n",
       " {'h.id': '435', 'c.name': 'Burien'},\n",
       " {'h.id': '436', 'c.name': 'Renton'},\n",
       " {'h.id': '437', 'c.name': 'Renton'},\n",
       " {'h.id': '438', 'c.name': 'Seattle'},\n",
       " {'h.id': '439', 'c.name': 'Black Diamond'},\n",
       " {'h.id': '440', 'c.name': 'North Bend'},\n",
       " {'h.id': '441', 'c.name': 'Bellevue'},\n",
       " {'h.id': '442', 'c.name': 'Sammamish'},\n",
       " {'h.id': '443', 'c.name': 'Bellevue'},\n",
       " {'h.id': '444', 'c.name': 'Redmond'},\n",
       " {'h.id': '445', 'c.name': 'Ravensdale'},\n",
       " {'h.id': '446', 'c.name': 'Ravensdale'},\n",
       " {'h.id': '447', 'c.name': 'Seattle'},\n",
       " {'h.id': '448', 'c.name': 'Federal Way'},\n",
       " {'h.id': '449', 'c.name': 'Duvall'},\n",
       " {'h.id': '450', 'c.name': 'Maple Valley'},\n",
       " {'h.id': '451', 'c.name': 'Renton'},\n",
       " {'h.id': '452', 'c.name': 'Mercer Island'},\n",
       " {'h.id': '453', 'c.name': 'Seattle'},\n",
       " {'h.id': '454', 'c.name': 'Woodinville'},\n",
       " {'h.id': '455', 'c.name': 'Seattle'},\n",
       " {'h.id': '456', 'c.name': 'Renton'},\n",
       " {'h.id': '457', 'c.name': 'Seattle'},\n",
       " {'h.id': '458', 'c.name': 'Kenmore'},\n",
       " {'h.id': '459', 'c.name': 'Seattle'},\n",
       " {'h.id': '460', 'c.name': 'Seattle'},\n",
       " {'h.id': '461', 'c.name': 'Carnation'},\n",
       " {'h.id': '462', 'c.name': 'Issaquah'},\n",
       " {'h.id': '463', 'c.name': 'Seattle'},\n",
       " {'h.id': '464', 'c.name': 'Seattle'},\n",
       " {'h.id': '465', 'c.name': 'Maple Valley'},\n",
       " {'h.id': '466', 'c.name': 'Seattle'},\n",
       " {'h.id': '467', 'c.name': 'Kent'},\n",
       " {'h.id': '468', 'c.name': 'Seattle'},\n",
       " {'h.id': '469', 'c.name': 'Seattle'},\n",
       " {'h.id': '470', 'c.name': 'Seattle'},\n",
       " {'h.id': '471', 'c.name': 'Redmond'},\n",
       " {'h.id': '472', 'c.name': 'Seattle'},\n",
       " {'h.id': '473', 'c.name': 'Issaquah'},\n",
       " {'h.id': '474', 'c.name': 'Clyde Hill'},\n",
       " {'h.id': '475', 'c.name': 'Seattle'},\n",
       " {'h.id': '476', 'c.name': 'Shoreline'},\n",
       " {'h.id': '477', 'c.name': 'Seattle'},\n",
       " {'h.id': '478', 'c.name': 'Mercer Island'},\n",
       " {'h.id': '479', 'c.name': 'Auburn'},\n",
       " {'h.id': '480', 'c.name': 'Bellevue'},\n",
       " {'h.id': '481', 'c.name': 'Seattle'},\n",
       " {'h.id': '482', 'c.name': 'Bellevue'},\n",
       " {'h.id': '483', 'c.name': 'Mercer Island'},\n",
       " {'h.id': '484', 'c.name': 'Duvall'},\n",
       " {'h.id': '485', 'c.name': 'Seattle'},\n",
       " {'h.id': '486', 'c.name': 'Bellevue'},\n",
       " {'h.id': '487', 'c.name': 'Seattle'},\n",
       " {'h.id': '488', 'c.name': 'Seattle'},\n",
       " {'h.id': '489', 'c.name': 'Seattle'},\n",
       " {'h.id': '490', 'c.name': 'Maple Valley'},\n",
       " {'h.id': '491', 'c.name': 'Seattle'},\n",
       " {'h.id': '492', 'c.name': 'Seattle'},\n",
       " {'h.id': '493', 'c.name': 'Renton'},\n",
       " {'h.id': '494', 'c.name': 'Sammamish'},\n",
       " {'h.id': '495', 'c.name': 'Woodinville'},\n",
       " {'h.id': '496', 'c.name': 'Auburn'},\n",
       " {'h.id': '497', 'c.name': 'Renton'},\n",
       " {'h.id': '498', 'c.name': 'Seattle'},\n",
       " {'h.id': '499', 'c.name': 'Kirkland'},\n",
       " {'h.id': '500', 'c.name': 'Seattle'},\n",
       " {'h.id': '501', 'c.name': 'Seattle'},\n",
       " {'h.id': '502', 'c.name': 'Redmond'},\n",
       " {'h.id': '503', 'c.name': 'Burien'},\n",
       " {'h.id': '504', 'c.name': 'Kirkland'},\n",
       " {'h.id': '505', 'c.name': 'Mercer Island'},\n",
       " {'h.id': '506', 'c.name': 'Mercer Island'},\n",
       " {'h.id': '507', 'c.name': 'Maple Valley'},\n",
       " {'h.id': '508', 'c.name': 'Seattle'},\n",
       " {'h.id': '509', 'c.name': 'Kent'},\n",
       " {'h.id': '510', 'c.name': 'Redmond'},\n",
       " {'h.id': '511', 'c.name': 'Seattle'},\n",
       " {'h.id': '512', 'c.name': 'Shoreline'},\n",
       " {'h.id': '513', 'c.name': 'Issaquah'},\n",
       " {'h.id': '514', 'c.name': 'Issaquah'},\n",
       " {'h.id': '515', 'c.name': 'Seattle'},\n",
       " {'h.id': '516', 'c.name': 'Seattle'},\n",
       " {'h.id': '517', 'c.name': 'Woodinville'},\n",
       " {'h.id': '518', 'c.name': 'Burien'},\n",
       " {'h.id': '519', 'c.name': 'Federal Way'},\n",
       " {'h.id': '520', 'c.name': 'Seattle'},\n",
       " {'h.id': '521', 'c.name': 'Redmond'},\n",
       " {'h.id': '522', 'c.name': 'Normandy Park'},\n",
       " {'h.id': '523', 'c.name': 'Seattle'},\n",
       " {'h.id': '524', 'c.name': 'Seattle'},\n",
       " {'h.id': '525', 'c.name': 'Clyde Hill'},\n",
       " {'h.id': '526', 'c.name': 'Seattle'},\n",
       " {'h.id': '527', 'c.name': 'Seattle'},\n",
       " {'h.id': '528', 'c.name': 'Kirkland'},\n",
       " {'h.id': '529', 'c.name': 'Maple Valley'},\n",
       " {'h.id': '530', 'c.name': 'Bellevue'},\n",
       " {'h.id': '531', 'c.name': 'Burien'},\n",
       " {'h.id': '532', 'c.name': 'Seattle'},\n",
       " {'h.id': '533', 'c.name': 'Seattle'},\n",
       " {'h.id': '534', 'c.name': 'Mercer Island'},\n",
       " {'h.id': '535', 'c.name': 'Vashon'},\n",
       " {'h.id': '536', 'c.name': 'Seattle'},\n",
       " {'h.id': '537', 'c.name': 'Bellevue'},\n",
       " {'h.id': '538', 'c.name': 'Seattle'},\n",
       " {'h.id': '539', 'c.name': 'Seattle'},\n",
       " {'h.id': '540', 'c.name': 'Seattle'},\n",
       " {'h.id': '541', 'c.name': 'Redmond'},\n",
       " {'h.id': '542', 'c.name': 'Maple Valley'},\n",
       " {'h.id': '543', 'c.name': 'Kirkland'},\n",
       " {'h.id': '544', 'c.name': 'Renton'},\n",
       " {'h.id': '545', 'c.name': 'Redmond'},\n",
       " {'h.id': '546', 'c.name': 'Seattle'},\n",
       " {'h.id': '547', 'c.name': 'Sammamish'},\n",
       " {'h.id': '548', 'c.name': 'Woodinville'},\n",
       " {'h.id': '549', 'c.name': 'Issaquah'},\n",
       " {'h.id': '550', 'c.name': 'Kenmore'},\n",
       " {'h.id': '551', 'c.name': 'Federal Way'},\n",
       " {'h.id': '552', 'c.name': 'Redmond'},\n",
       " {'h.id': '553', 'c.name': 'Shoreline'},\n",
       " {'h.id': '554', 'c.name': 'Renton'},\n",
       " {'h.id': '555', 'c.name': 'Kent'},\n",
       " {'h.id': '556', 'c.name': 'Seattle'},\n",
       " {'h.id': '557', 'c.name': 'Issaquah'},\n",
       " {'h.id': '558', 'c.name': 'Bellevue'},\n",
       " {'h.id': '559', 'c.name': 'Bellevue'},\n",
       " {'h.id': '560', 'c.name': 'Seattle'},\n",
       " {'h.id': '561', 'c.name': 'Redmond'},\n",
       " {'h.id': '562', 'c.name': 'Seattle'},\n",
       " {'h.id': '563', 'c.name': 'Seattle'},\n",
       " {'h.id': '564', 'c.name': 'Yarrow Point'},\n",
       " {'h.id': '565', 'c.name': 'Kent'},\n",
       " {'h.id': '566', 'c.name': 'Duvall'},\n",
       " {'h.id': '567', 'c.name': 'Seattle'},\n",
       " {'h.id': '568', 'c.name': 'Auburn'},\n",
       " {'h.id': '569', 'c.name': 'Seattle'},\n",
       " {'h.id': '570', 'c.name': 'Bellevue'},\n",
       " {'h.id': '571', 'c.name': 'Renton'},\n",
       " {'h.id': '572', 'c.name': 'Seattle'},\n",
       " {'h.id': '573', 'c.name': 'Seattle'},\n",
       " {'h.id': '574', 'c.name': 'Seattle'},\n",
       " {'h.id': '575', 'c.name': 'Seattle'},\n",
       " {'h.id': '576', 'c.name': 'Bellevue'},\n",
       " {'h.id': '577', 'c.name': 'Shoreline'},\n",
       " {'h.id': '578', 'c.name': 'Sammamish'},\n",
       " {'h.id': '579', 'c.name': 'Vashon'},\n",
       " {'h.id': '580', 'c.name': 'Woodinville'},\n",
       " {'h.id': '581', 'c.name': 'Seattle'},\n",
       " {'h.id': '582', 'c.name': 'Seattle'},\n",
       " {'h.id': '583', 'c.name': 'SeaTac'},\n",
       " {'h.id': '584', 'c.name': 'Seattle'},\n",
       " {'h.id': '585', 'c.name': 'Kirkland'},\n",
       " {'h.id': '586', 'c.name': 'Seattle'},\n",
       " {'h.id': '587', 'c.name': 'Seattle'},\n",
       " {'h.id': '588', 'c.name': 'Kirkland'},\n",
       " {'h.id': '589', 'c.name': 'Bellevue'},\n",
       " {'h.id': '590', 'c.name': 'Newcastle'},\n",
       " {'h.id': '591', 'c.name': 'Bellevue'},\n",
       " {'h.id': '592', 'c.name': 'Mercer Island'},\n",
       " {'h.id': '593', 'c.name': 'Shoreline'},\n",
       " {'h.id': '594', 'c.name': 'Seattle'},\n",
       " {'h.id': '595', 'c.name': 'Redmond'},\n",
       " {'h.id': '596', 'c.name': 'Seattle'},\n",
       " {'h.id': '597', 'c.name': 'Seattle'},\n",
       " {'h.id': '598', 'c.name': 'Seattle'},\n",
       " {'h.id': '599', 'c.name': 'Covington'},\n",
       " {'h.id': '600', 'c.name': 'Bellevue'},\n",
       " {'h.id': '601', 'c.name': 'Bellevue'},\n",
       " {'h.id': '602', 'c.name': 'Bellevue'},\n",
       " {'h.id': '603', 'c.name': 'Mercer Island'},\n",
       " {'h.id': '604', 'c.name': 'Burien'},\n",
       " {'h.id': '605', 'c.name': 'Normandy Park'},\n",
       " {'h.id': '606', 'c.name': 'Mercer Island'},\n",
       " {'h.id': '607', 'c.name': 'Seattle'},\n",
       " {'h.id': '608', 'c.name': 'Lake Forest Park'},\n",
       " {'h.id': '609', 'c.name': 'Seattle'},\n",
       " {'h.id': '610', 'c.name': 'Auburn'},\n",
       " {'h.id': '611', 'c.name': 'Mercer Island'},\n",
       " {'h.id': '612', 'c.name': 'Auburn'},\n",
       " {'h.id': '613', 'c.name': 'Woodinville'},\n",
       " {'h.id': '614', 'c.name': 'Duvall'},\n",
       " {'h.id': '615', 'c.name': 'Seattle'},\n",
       " {'h.id': '616', 'c.name': 'Seattle'},\n",
       " {'h.id': '617', 'c.name': 'Snoqualmie'},\n",
       " {'h.id': '618', 'c.name': 'Kenmore'},\n",
       " {'h.id': '619', 'c.name': 'Woodinville'},\n",
       " {'h.id': '620', 'c.name': 'Seattle'},\n",
       " {'h.id': '621', 'c.name': 'Snoqualmie'},\n",
       " {'h.id': '622', 'c.name': 'Seattle'},\n",
       " {'h.id': '623', 'c.name': 'Seattle'},\n",
       " {'h.id': '624', 'c.name': 'Renton'},\n",
       " {'h.id': '625', 'c.name': 'Seattle'},\n",
       " {'h.id': '626', 'c.name': 'Seattle'},\n",
       " {'h.id': '627', 'c.name': 'Seattle'},\n",
       " {'h.id': '628', 'c.name': 'Seattle'},\n",
       " {'h.id': '629', 'c.name': 'Mercer Island'},\n",
       " {'h.id': '630', 'c.name': 'Bellevue'},\n",
       " {'h.id': '631', 'c.name': 'Seattle'},\n",
       " {'h.id': '632', 'c.name': 'Seattle'},\n",
       " {'h.id': '633', 'c.name': 'Des Moines'},\n",
       " {'h.id': '634', 'c.name': 'Federal Way'},\n",
       " {'h.id': '635', 'c.name': 'Renton'},\n",
       " {'h.id': '636', 'c.name': 'Sammamish'},\n",
       " {'h.id': '637', 'c.name': 'Normandy Park'},\n",
       " {'h.id': '638', 'c.name': 'Renton'},\n",
       " {'h.id': '639', 'c.name': 'Kent'},\n",
       " {'h.id': '640', 'c.name': 'Auburn'},\n",
       " {'h.id': '641', 'c.name': 'Auburn'},\n",
       " {'h.id': '642', 'c.name': 'Seattle'},\n",
       " {'h.id': '643', 'c.name': 'Seattle'},\n",
       " {'h.id': '644', 'c.name': 'Seattle'},\n",
       " {'h.id': '645', 'c.name': 'Kirkland'},\n",
       " {'h.id': '646', 'c.name': 'Seattle'},\n",
       " {'h.id': '647', 'c.name': 'Issaquah'},\n",
       " {'h.id': '648', 'c.name': 'Kenmore'},\n",
       " {'h.id': '649', 'c.name': 'Seattle'},\n",
       " {'h.id': '650', 'c.name': 'Seattle'},\n",
       " {'h.id': '651', 'c.name': 'Maple Valley'},\n",
       " {'h.id': '652', 'c.name': 'Seattle'},\n",
       " {'h.id': '653', 'c.name': 'Newcastle'},\n",
       " {'h.id': '654', 'c.name': 'Issaquah'},\n",
       " {'h.id': '655', 'c.name': 'Woodinville'},\n",
       " {'h.id': '656', 'c.name': 'Seattle'},\n",
       " {'h.id': '657', 'c.name': 'Kent'},\n",
       " {'h.id': '658', 'c.name': 'Shoreline'},\n",
       " {'h.id': '659', 'c.name': 'Seattle'},\n",
       " {'h.id': '660', 'c.name': 'Shoreline'},\n",
       " {'h.id': '661', 'c.name': 'Seattle'},\n",
       " {'h.id': '662', 'c.name': 'Auburn'},\n",
       " {'h.id': '663', 'c.name': 'Seattle'},\n",
       " {'h.id': '664', 'c.name': 'Fall City'},\n",
       " {'h.id': '665', 'c.name': 'Kent'},\n",
       " {'h.id': '666', 'c.name': 'Shoreline'},\n",
       " {'h.id': '667', 'c.name': 'Auburn'},\n",
       " {'h.id': '668', 'c.name': 'Bellevue'},\n",
       " {'h.id': '669', 'c.name': 'Federal Way'},\n",
       " {'h.id': '670', 'c.name': 'Kenmore'},\n",
       " {'h.id': '671', 'c.name': 'Ravensdale'},\n",
       " {'h.id': '672', 'c.name': 'Tukwila'},\n",
       " {'h.id': '673', 'c.name': 'Duvall'},\n",
       " {'h.id': '674', 'c.name': 'Seattle'},\n",
       " {'h.id': '675', 'c.name': 'Woodinville'},\n",
       " {'h.id': '676', 'c.name': 'Seattle'},\n",
       " {'h.id': '677', 'c.name': 'Sammamish'},\n",
       " {'h.id': '678', 'c.name': 'Renton'},\n",
       " {'h.id': '679', 'c.name': 'Issaquah'},\n",
       " {'h.id': '680', 'c.name': 'Renton'},\n",
       " {'h.id': '681', 'c.name': 'Redmond'},\n",
       " {'h.id': '682', 'c.name': 'Shoreline'},\n",
       " {'h.id': '683', 'c.name': 'SeaTac'},\n",
       " {'h.id': '684', 'c.name': 'Shoreline'},\n",
       " {'h.id': '685', 'c.name': 'Auburn'},\n",
       " {'h.id': '686', 'c.name': 'Kirkland'},\n",
       " {'h.id': '687', 'c.name': 'Seattle'},\n",
       " {'h.id': '688', 'c.name': 'Auburn'},\n",
       " {'h.id': '689', 'c.name': 'Seattle'},\n",
       " {'h.id': '690', 'c.name': 'Redmond'},\n",
       " {'h.id': '691', 'c.name': 'Covington'},\n",
       " {'h.id': '692', 'c.name': 'Bellevue'},\n",
       " {'h.id': '693', 'c.name': 'Seattle'},\n",
       " {'h.id': '694', 'c.name': 'Redmond'},\n",
       " {'h.id': '695', 'c.name': 'Sammamish'},\n",
       " {'h.id': '696', 'c.name': 'Bellevue'},\n",
       " {'h.id': '697', 'c.name': 'Auburn'},\n",
       " {'h.id': '698', 'c.name': 'Kirkland'},\n",
       " {'h.id': '699', 'c.name': 'Federal Way'},\n",
       " {'h.id': '700', 'c.name': 'Mercer Island'},\n",
       " {'h.id': '701', 'c.name': 'Tukwila'},\n",
       " {'h.id': '702', 'c.name': 'Renton'},\n",
       " {'h.id': '703', 'c.name': 'Issaquah'},\n",
       " {'h.id': '704', 'c.name': 'Sammamish'},\n",
       " {'h.id': '705', 'c.name': 'Federal Way'},\n",
       " {'h.id': '706', 'c.name': 'Sammamish'},\n",
       " {'h.id': '707', 'c.name': 'Renton'},\n",
       " {'h.id': '708', 'c.name': 'Auburn'},\n",
       " {'h.id': '709', 'c.name': 'Bellevue'},\n",
       " {'h.id': '710', 'c.name': 'Seattle'},\n",
       " {'h.id': '711', 'c.name': 'Sammamish'},\n",
       " {'h.id': '712', 'c.name': 'Kent'},\n",
       " {'h.id': '713', 'c.name': 'Renton'},\n",
       " {'h.id': '714', 'c.name': 'Seattle'},\n",
       " {'h.id': '715', 'c.name': 'Renton'},\n",
       " {'h.id': '716', 'c.name': 'Federal Way'},\n",
       " {'h.id': '717', 'c.name': 'Seattle'},\n",
       " {'h.id': '718', 'c.name': 'Federal Way'},\n",
       " {'h.id': '719', 'c.name': 'Seattle'},\n",
       " {'h.id': '720', 'c.name': 'Seattle'},\n",
       " {'h.id': '721', 'c.name': 'Shoreline'},\n",
       " {'h.id': '722', 'c.name': 'Kirkland'},\n",
       " {'h.id': '723', 'c.name': 'Tukwila'},\n",
       " {'h.id': '724', 'c.name': 'Seattle'},\n",
       " {'h.id': '725', 'c.name': 'Redmond'},\n",
       " {'h.id': '726', 'c.name': 'Bellevue'},\n",
       " {'h.id': '727', 'c.name': 'Kenmore'},\n",
       " {'h.id': '728', 'c.name': 'Redmond'},\n",
       " {'h.id': '729', 'c.name': 'Kent'},\n",
       " {'h.id': '730', 'c.name': 'Kenmore'},\n",
       " {'h.id': '731', 'c.name': 'Renton'},\n",
       " {'h.id': '732', 'c.name': 'Redmond'},\n",
       " {'h.id': '733', 'c.name': 'North Bend'},\n",
       " {'h.id': '734', 'c.name': 'Seattle'},\n",
       " {'h.id': '735', 'c.name': 'Seattle'},\n",
       " {'h.id': '736', 'c.name': 'Bellevue'},\n",
       " {'h.id': '737', 'c.name': 'Seattle'},\n",
       " {'h.id': '738', 'c.name': 'Issaquah'},\n",
       " {'h.id': '739', 'c.name': 'Auburn'},\n",
       " {'h.id': '740', 'c.name': 'Sammamish'},\n",
       " {'h.id': '741', 'c.name': 'Issaquah'},\n",
       " {'h.id': '742', 'c.name': 'Shoreline'},\n",
       " {'h.id': '743', 'c.name': 'Seattle'},\n",
       " {'h.id': '744', 'c.name': 'Maple Valley'},\n",
       " {'h.id': '745', 'c.name': 'Medina'},\n",
       " {'h.id': '746', 'c.name': 'Seattle'},\n",
       " {'h.id': '747', 'c.name': 'Duvall'},\n",
       " {'h.id': '748', 'c.name': 'Sammamish'},\n",
       " {'h.id': '749', 'c.name': 'Federal Way'},\n",
       " {'h.id': '750', 'c.name': 'Shoreline'},\n",
       " {'h.id': '751', 'c.name': 'Woodinville'},\n",
       " {'h.id': '752', 'c.name': 'Renton'},\n",
       " {'h.id': '753', 'c.name': 'Woodinville'},\n",
       " {'h.id': '754', 'c.name': 'Seattle'},\n",
       " {'h.id': '755', 'c.name': 'Seattle'},\n",
       " {'h.id': '756', 'c.name': 'Shoreline'},\n",
       " {'h.id': '757', 'c.name': 'Seattle'},\n",
       " {'h.id': '758', 'c.name': 'Seattle'},\n",
       " {'h.id': '759', 'c.name': 'Seattle'},\n",
       " {'h.id': '760', 'c.name': 'Bellevue'},\n",
       " {'h.id': '761', 'c.name': 'Covington'},\n",
       " {'h.id': '762', 'c.name': 'Seattle'},\n",
       " {'h.id': '763', 'c.name': 'Kirkland'},\n",
       " {'h.id': '764', 'c.name': 'Bellevue'},\n",
       " {'h.id': '765', 'c.name': 'Seattle'},\n",
       " {'h.id': '766', 'c.name': 'Seattle'},\n",
       " {'h.id': '767', 'c.name': 'Seattle'},\n",
       " {'h.id': '768', 'c.name': 'Lake Forest Park'},\n",
       " {'h.id': '769', 'c.name': 'Seattle'},\n",
       " {'h.id': '770', 'c.name': 'Renton'},\n",
       " {'h.id': '771', 'c.name': 'Seattle'},\n",
       " {'h.id': '772', 'c.name': 'Issaquah'},\n",
       " {'h.id': '773', 'c.name': 'Seattle'},\n",
       " {'h.id': '774', 'c.name': 'Redmond'},\n",
       " {'h.id': '775', 'c.name': 'Seattle'},\n",
       " {'h.id': '776', 'c.name': 'Issaquah'},\n",
       " {'h.id': '777', 'c.name': 'Redmond'},\n",
       " {'h.id': '778', 'c.name': 'Seattle'},\n",
       " {'h.id': '779', 'c.name': 'Fall City'},\n",
       " {'h.id': '780', 'c.name': 'Sammamish'},\n",
       " {'h.id': '781', 'c.name': 'Newcastle'},\n",
       " {'h.id': '782', 'c.name': 'Kent'},\n",
       " {'h.id': '783', 'c.name': 'North Bend'},\n",
       " {'h.id': '784', 'c.name': 'Seattle'},\n",
       " {'h.id': '785', 'c.name': 'Snoqualmie'},\n",
       " {'h.id': '786', 'c.name': 'Seattle'},\n",
       " {'h.id': '787', 'c.name': 'Seattle'},\n",
       " {'h.id': '788', 'c.name': 'Renton'},\n",
       " {'h.id': '789', 'c.name': 'Seattle'},\n",
       " {'h.id': '790', 'c.name': 'Seattle'},\n",
       " {'h.id': '791', 'c.name': 'Seattle'},\n",
       " {'h.id': '792', 'c.name': 'Federal Way'},\n",
       " {'h.id': '793', 'c.name': 'Kirkland'},\n",
       " {'h.id': '794', 'c.name': 'North Bend'},\n",
       " {'h.id': '795', 'c.name': 'Tukwila'},\n",
       " {'h.id': '796', 'c.name': 'Federal Way'},\n",
       " {'h.id': '797', 'c.name': 'Issaquah'},\n",
       " {'h.id': '798', 'c.name': 'Vashon'},\n",
       " {'h.id': '799', 'c.name': 'Sammamish'},\n",
       " {'h.id': '800', 'c.name': 'Kirkland'},\n",
       " {'h.id': '801', 'c.name': 'Kent'},\n",
       " {'h.id': '802', 'c.name': 'Seattle'},\n",
       " {'h.id': '803', 'c.name': 'Renton'},\n",
       " {'h.id': '804', 'c.name': 'Seattle'},\n",
       " {'h.id': '805', 'c.name': 'Redmond'},\n",
       " {'h.id': '806', 'c.name': 'Seattle'},\n",
       " {'h.id': '807', 'c.name': 'Maple Valley'},\n",
       " {'h.id': '808', 'c.name': 'Seattle'},\n",
       " {'h.id': '809', 'c.name': 'Maple Valley'},\n",
       " {'h.id': '810', 'c.name': 'Seattle'},\n",
       " {'h.id': '811', 'c.name': 'Seattle'},\n",
       " {'h.id': '812', 'c.name': 'Woodinville'},\n",
       " {'h.id': '813', 'c.name': 'Kent'},\n",
       " {'h.id': '814', 'c.name': 'Shoreline'},\n",
       " {'h.id': '815', 'c.name': 'Des Moines'},\n",
       " {'h.id': '816', 'c.name': 'Federal Way'},\n",
       " {'h.id': '817', 'c.name': 'Woodinville'},\n",
       " {'h.id': '818', 'c.name': 'Renton'},\n",
       " {'h.id': '819', 'c.name': 'Kent'},\n",
       " {'h.id': '820', 'c.name': 'Seattle'},\n",
       " {'h.id': '821', 'c.name': 'Seattle'},\n",
       " {'h.id': '822', 'c.name': 'Seattle'},\n",
       " {'h.id': '823', 'c.name': 'Seattle'},\n",
       " {'h.id': '824', 'c.name': 'Snoqualmie'},\n",
       " {'h.id': '825', 'c.name': 'Seattle'},\n",
       " {'h.id': '826', 'c.name': 'Seattle'},\n",
       " {'h.id': '827', 'c.name': 'Kent'},\n",
       " {'h.id': '828', 'c.name': 'Issaquah'},\n",
       " {'h.id': '829', 'c.name': 'Bothell'},\n",
       " {'h.id': '830', 'c.name': 'Des Moines'},\n",
       " {'h.id': '831', 'c.name': 'Seattle'},\n",
       " {'h.id': '832', 'c.name': 'Seattle'},\n",
       " {'h.id': '833', 'c.name': 'Covington'},\n",
       " {'h.id': '834', 'c.name': 'Sammamish'},\n",
       " {'h.id': '835', 'c.name': 'Maple Valley'},\n",
       " {'h.id': '836', 'c.name': 'Bellevue'},\n",
       " {'h.id': '837', 'c.name': 'Seattle'},\n",
       " {'h.id': '838', 'c.name': 'Kenmore'},\n",
       " {'h.id': '839', 'c.name': 'Mercer Island'},\n",
       " {'h.id': '840', 'c.name': 'Issaquah'},\n",
       " {'h.id': '841', 'c.name': 'Snoqualmie'},\n",
       " {'h.id': '842', 'c.name': 'Sammamish'},\n",
       " {'h.id': '843', 'c.name': 'Seattle'},\n",
       " {'h.id': '844', 'c.name': 'Snoqualmie'},\n",
       " {'h.id': '845', 'c.name': 'Issaquah'},\n",
       " {'h.id': '846', 'c.name': 'Shoreline'},\n",
       " {'h.id': '847', 'c.name': 'Bellevue'},\n",
       " {'h.id': '848', 'c.name': 'Seattle'},\n",
       " {'h.id': '849', 'c.name': 'Seattle'},\n",
       " {'h.id': '850', 'c.name': 'Renton'},\n",
       " {'h.id': '851', 'c.name': 'Enumclaw'},\n",
       " {'h.id': '852', 'c.name': 'Redmond'},\n",
       " {'h.id': '853', 'c.name': 'Woodinville'},\n",
       " {'h.id': '854', 'c.name': 'Snoqualmie'},\n",
       " {'h.id': '855', 'c.name': 'Seattle'},\n",
       " {'h.id': '856', 'c.name': 'Bellevue'},\n",
       " {'h.id': '857', 'c.name': 'Renton'},\n",
       " {'h.id': '858', 'c.name': 'Seattle'},\n",
       " {'h.id': '859', 'c.name': 'Kent'},\n",
       " {'h.id': '860', 'c.name': 'Seattle'},\n",
       " {'h.id': '861', 'c.name': 'Federal Way'},\n",
       " {'h.id': '862', 'c.name': 'Bellevue'},\n",
       " {'h.id': '863', 'c.name': 'Renton'},\n",
       " {'h.id': '864', 'c.name': 'Seattle'},\n",
       " {'h.id': '865', 'c.name': 'Maple Valley'},\n",
       " {'h.id': '866', 'c.name': 'Seattle'},\n",
       " {'h.id': '867', 'c.name': 'Shoreline'},\n",
       " {'h.id': '868', 'c.name': 'Seattle'},\n",
       " {'h.id': '869', 'c.name': 'Seattle'},\n",
       " {'h.id': '870', 'c.name': 'Seattle'},\n",
       " {'h.id': '871', 'c.name': 'North Bend'},\n",
       " {'h.id': '872', 'c.name': 'Seattle'},\n",
       " {'h.id': '873', 'c.name': 'Seattle'},\n",
       " {'h.id': '874', 'c.name': 'Vashon'},\n",
       " {'h.id': '875', 'c.name': 'Seattle'},\n",
       " {'h.id': '876', 'c.name': 'Kent'},\n",
       " {'h.id': '877', 'c.name': 'Seattle'},\n",
       " {'h.id': '878', 'c.name': 'Auburn'},\n",
       " {'h.id': '879', 'c.name': 'North Bend'},\n",
       " {'h.id': '880', 'c.name': 'Bellevue'},\n",
       " {'h.id': '881', 'c.name': 'Auburn'},\n",
       " {'h.id': '882', 'c.name': 'Seattle'},\n",
       " {'h.id': '883', 'c.name': 'Kirkland'},\n",
       " {'h.id': '884', 'c.name': 'Shoreline'},\n",
       " {'h.id': '885', 'c.name': 'Issaquah'},\n",
       " {'h.id': '886', 'c.name': 'Seattle'},\n",
       " {'h.id': '887', 'c.name': 'Maple Valley'},\n",
       " {'h.id': '888', 'c.name': 'Seattle'},\n",
       " {'h.id': '889', 'c.name': 'Woodinville'},\n",
       " {'h.id': '890', 'c.name': 'Seattle'},\n",
       " {'h.id': '891', 'c.name': 'Federal Way'},\n",
       " {'h.id': '892', 'c.name': 'Kent'},\n",
       " {'h.id': '893', 'c.name': 'Renton'},\n",
       " {'h.id': '894', 'c.name': 'Seattle'},\n",
       " {'h.id': '895', 'c.name': 'Redmond'},\n",
       " {'h.id': '896', 'c.name': 'Issaquah'},\n",
       " {'h.id': '897', 'c.name': 'Woodinville'},\n",
       " {'h.id': '898', 'c.name': 'Redmond'},\n",
       " {'h.id': '899', 'c.name': 'Seattle'},\n",
       " {'h.id': '900', 'c.name': 'Seattle'},\n",
       " {'h.id': '901', 'c.name': 'Des Moines'},\n",
       " {'h.id': '902', 'c.name': 'Issaquah'},\n",
       " {'h.id': '903', 'c.name': 'Woodinville'},\n",
       " {'h.id': '904', 'c.name': 'Redmond'},\n",
       " {'h.id': '905', 'c.name': 'Renton'},\n",
       " {'h.id': '906', 'c.name': 'Seattle'},\n",
       " {'h.id': '907', 'c.name': 'Renton'},\n",
       " {'h.id': '908', 'c.name': 'SeaTac'},\n",
       " {'h.id': '909', 'c.name': 'Seattle'},\n",
       " {'h.id': '910', 'c.name': 'Bellevue'},\n",
       " {'h.id': '911', 'c.name': 'Renton'},\n",
       " {'h.id': '912', 'c.name': 'Seattle'},\n",
       " {'h.id': '913', 'c.name': 'Seattle'},\n",
       " {'h.id': '914', 'c.name': 'Seattle'},\n",
       " {'h.id': '915', 'c.name': 'Redmond'},\n",
       " {'h.id': '916', 'c.name': 'Shoreline'},\n",
       " {'h.id': '917', 'c.name': 'Carnation'},\n",
       " {'h.id': '918', 'c.name': 'Renton'},\n",
       " {'h.id': '919', 'c.name': 'Des Moines'},\n",
       " {'h.id': '920', 'c.name': 'Seattle'},\n",
       " {'h.id': '921', 'c.name': 'North Bend'},\n",
       " {'h.id': '922', 'c.name': 'Kenmore'},\n",
       " {'h.id': '923', 'c.name': 'Newcastle'},\n",
       " {'h.id': '924', 'c.name': 'Seattle'},\n",
       " {'h.id': '925', 'c.name': 'Seattle'},\n",
       " {'h.id': '926', 'c.name': 'Bellevue'},\n",
       " {'h.id': '927', 'c.name': 'Seattle'},\n",
       " {'h.id': '928', 'c.name': 'Seattle'},\n",
       " {'h.id': '929', 'c.name': 'Kirkland'},\n",
       " {'h.id': '930', 'c.name': 'Redmond'},\n",
       " {'h.id': '931', 'c.name': 'Seattle'},\n",
       " {'h.id': '932', 'c.name': 'Federal Way'},\n",
       " {'h.id': '933', 'c.name': 'Snoqualmie'},\n",
       " {'h.id': '934', 'c.name': 'Sammamish'},\n",
       " {'h.id': '935', 'c.name': 'Kenmore'},\n",
       " {'h.id': '936', 'c.name': 'Seattle'},\n",
       " {'h.id': '937', 'c.name': 'Normandy Park'},\n",
       " {'h.id': '938', 'c.name': 'Seattle'},\n",
       " {'h.id': '939', 'c.name': 'Seattle'},\n",
       " {'h.id': '940', 'c.name': 'Seattle'},\n",
       " {'h.id': '941', 'c.name': 'Seattle'},\n",
       " {'h.id': '942', 'c.name': 'Renton'},\n",
       " {'h.id': '943', 'c.name': 'Seattle'},\n",
       " {'h.id': '944', 'c.name': 'Seattle'},\n",
       " {'h.id': '945', 'c.name': 'Kent'},\n",
       " {'h.id': '946', 'c.name': 'Seattle'},\n",
       " {'h.id': '947', 'c.name': 'Seattle'},\n",
       " {'h.id': '948', 'c.name': 'Redmond'},\n",
       " {'h.id': '949', 'c.name': 'Seattle'},\n",
       " {'h.id': '950', 'c.name': 'Redmond'},\n",
       " {'h.id': '951', 'c.name': 'Renton'},\n",
       " {'h.id': '952', 'c.name': 'Bellevue'},\n",
       " {'h.id': '953', 'c.name': 'Seattle'},\n",
       " {'h.id': '954', 'c.name': 'Seattle'},\n",
       " {'h.id': '955', 'c.name': 'Seattle'},\n",
       " {'h.id': '956', 'c.name': 'Seattle'},\n",
       " {'h.id': '957', 'c.name': 'Bellevue'},\n",
       " {'h.id': '958', 'c.name': 'Seattle'},\n",
       " {'h.id': '959', 'c.name': 'Kirkland'},\n",
       " {'h.id': '960', 'c.name': 'Auburn'},\n",
       " {'h.id': '961', 'c.name': 'Kent'},\n",
       " {'h.id': '962', 'c.name': 'Redmond'},\n",
       " {'h.id': '963', 'c.name': 'Seattle'},\n",
       " {'h.id': '964', 'c.name': 'Woodinville'},\n",
       " {'h.id': '965', 'c.name': 'Redmond'},\n",
       " {'h.id': '966', 'c.name': 'Redmond'},\n",
       " {'h.id': '967', 'c.name': 'Renton'},\n",
       " {'h.id': '968', 'c.name': 'Seattle'},\n",
       " {'h.id': '969', 'c.name': 'Woodinville'},\n",
       " {'h.id': '970', 'c.name': 'Bellevue'},\n",
       " {'h.id': '971', 'c.name': 'Maple Valley'},\n",
       " {'h.id': '972', 'c.name': 'Renton'},\n",
       " {'h.id': '973', 'c.name': 'Kenmore'},\n",
       " {'h.id': '974', 'c.name': 'Seattle'},\n",
       " {'h.id': '975', 'c.name': 'Seattle'},\n",
       " {'h.id': '976', 'c.name': 'Maple Valley'},\n",
       " {'h.id': '977', 'c.name': 'Seattle'},\n",
       " {'h.id': '978', 'c.name': 'Auburn'},\n",
       " {'h.id': '979', 'c.name': 'Seattle'},\n",
       " {'h.id': '980', 'c.name': 'Renton'},\n",
       " {'h.id': '981', 'c.name': 'Shoreline'},\n",
       " {'h.id': '982', 'c.name': 'Seattle'},\n",
       " {'h.id': '983', 'c.name': 'Renton'},\n",
       " {'h.id': '984', 'c.name': 'Seattle'},\n",
       " {'h.id': '985', 'c.name': 'Seattle'},\n",
       " {'h.id': '986', 'c.name': 'Seattle'},\n",
       " {'h.id': '987', 'c.name': 'Seattle'},\n",
       " {'h.id': '988', 'c.name': 'Redmond'},\n",
       " {'h.id': '989', 'c.name': 'Seattle'},\n",
       " {'h.id': '990', 'c.name': 'Federal Way'},\n",
       " {'h.id': '991', 'c.name': 'Covington'},\n",
       " {'h.id': '992', 'c.name': 'SeaTac'},\n",
       " {'h.id': '993', 'c.name': 'Federal Way'},\n",
       " {'h.id': '994', 'c.name': 'Seattle'},\n",
       " {'h.id': '995', 'c.name': 'Medina'},\n",
       " {'h.id': '996', 'c.name': 'Shoreline'},\n",
       " {'h.id': '997', 'c.name': 'Bellevue'},\n",
       " {'h.id': '998', 'c.name': 'Seattle'},\n",
       " {'h.id': '999', 'c.name': 'Renton'},\n",
       " ...]"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 19
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": "",
   "id": "f5f5c98cecdec445"
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
